IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ128GC008.h
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL0 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL0BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL0BITS;
extern volatile ADTBL0BITS ADTBL0bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL1 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL1BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL1BITS;
extern volatile ADTBL1BITS ADTBL1bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL2 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL2BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL2BITS;
extern volatile ADTBL2BITS ADTBL2bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL3 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL3BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL3BITS;
extern volatile ADTBL3BITS ADTBL3bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL4 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL4BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL4BITS;
extern volatile ADTBL4BITS ADTBL4bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL5 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL5BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL5BITS;
extern volatile ADTBL5BITS ADTBL5bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL6 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL6BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL6BITS;
extern volatile ADTBL6BITS ADTBL6bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL7 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL7BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL7BITS;
extern volatile ADTBL7BITS ADTBL7bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL8 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL8BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL8BITS;
extern volatile ADTBL8BITS ADTBL8bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL9 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL9BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL9BITS;
extern volatile ADTBL9BITS ADTBL9bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL10 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL10BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL10BITS;
extern volatile ADTBL10BITS ADTBL10bits __attribute__((__sfr__));

extern volatile unsigned int  ADTBL11 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL11BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL11BITS;
extern volatile ADTBL11BITS ADTBL11bits __attribute__((__sfr__));

