IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ128GC008.h
extern volatile unsigned int  ADL2CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONHBITS {
  union {
    struct {
      unsigned SAMC:5;
      unsigned MULCHEN:1;
      unsigned PINTRIS:1;
      unsigned CTMEN:1;
      unsigned CM:3;
      unsigned WM:2;
      unsigned SLINT:2;
      unsigned ASEN:1;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned :3;
      unsigned CM0:1;
      unsigned CM1:1;
      unsigned CM2:1;
      unsigned WM0:1;
      unsigned WM1:1;
      unsigned SLINT0:1;
      unsigned SLINT1:1;
    };
  };
} ADL2CONHBITS;
extern volatile ADL2CONHBITS ADL2CONHbits __attribute__((__sfr__));

extern volatile unsigned int  ADL2PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL2PTRBITS {
  union {
    struct {
      unsigned :8;
      unsigned ADNEXT:7;
    };
    struct {
      unsigned :8;
      unsigned ADNEXT0:1;
      unsigned ADNEXT1:1;
      unsigned ADNEXT2:1;
      unsigned ADNEXT3:1;
      unsigned ADNEXT4:1;
      unsigned ADNEXT5:1;
      unsigned ADNEXT6:1;
    };
  };
} ADL2PTRBITS;
extern volatile ADL2PTRBITS ADL2PTRbits __attribute__((__sfr__));

extern volatile unsigned int  ADL2STAT __attribute__((__sfr__));
typedef struct tagADL2STATBITS {
  unsigned :5;
  unsigned ADLIF:1;
  unsigned :1;
  unsigned ADTDLY:1;
  unsigned :6;
  unsigned LBUSY:1;
  unsigned ADTACT:1;
} ADL2STATBITS;
extern volatile ADL2STATBITS ADL2STATbits __attribute__((__sfr__));

extern volatile unsigned int  ADTH2L __attribute__((__sfr__));
typedef struct tagADTH2LBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH2LBITS;
extern volatile ADTH2LBITS ADTH2Lbits __attribute__((__sfr__));

extern volatile unsigned int  ADTH2H __attribute__((__sfr__));
typedef struct tagADTH2HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH2HBITS;
extern volatile ADTH2HBITS ADTH2Hbits __attribute__((__sfr__));

extern volatile unsigned long longADL2MSEL __attribute__((__sfr__));
extern volatile unsigned int  ADL2MSEL0 __attribute__((__sfr__));
typedef struct tagADL2MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL2MSEL0BITS;
extern volatile ADL2MSEL0BITS ADL2MSEL0bits __attribute__((__sfr__));

extern volatile unsigned int  ADL2MSEL1 __attribute__((__sfr__));
typedef struct tagADL2MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL2MSEL1BITS;
extern volatile ADL2MSEL1BITS ADL2MSEL1bits __attribute__((__sfr__));

extern volatile unsigned int  ADL2MSEL2 __attribute__((__sfr__));
typedef struct tagADL2MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL2MSEL2BITS;
extern volatile ADL2MSEL2BITS ADL2MSEL2bits __attribute__((__sfr__));

extern volatile unsigned int  ADL2MSEL3 __attribute__((__sfr__));
typedef struct tagADL2MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL2MSEL3BITS;
extern volatile ADL2MSEL3BITS ADL2MSEL3bits __attribute__((__sfr__));

extern volatile unsigned int  LCDREG __attribute__((__sfr__));
__extension__ typedef struct tagLCDREGBITS {
  union {
    struct {
      unsigned CKSEL:2;
      unsigned MODE13:1;
      unsigned BIAS:3;
      unsigned :9;
      unsigned CPEN:1;
    };
    struct {
      unsigned CKSEL0:1;
      unsigned CKSEL1:1;
      unsigned :1;
      unsigned BIAS0:1;
      unsigned BIAS1:1;
      unsigned BIAS2:1;
    };
  };
} LCDREGBITS;
extern volatile LCDREGBITS LCDREGbits __attribute__((__sfr__));

extern volatile unsigned int  LCDREF __attribute__((__sfr__));
__extension__ typedef struct tagLCDREFBITS {
  union {
    struct {
      unsigned LRLAT:3;
      unsigned :1;
      unsigned LRLBP:2;
      unsigned LRLAP:2;
      unsigned VLCD1PE:1;
      unsigned VLCD2PE:1;
      unsigned VLCD3PE:1;
      unsigned LCDCST:3;
      unsigned :1;
      unsigned LCDIRE:1;
    };
    struct {
      unsigned LRLAT0:1;
      unsigned LRLAT1:1;
      unsigned LRLAT2:1;
      unsigned :1;
      unsigned LRLBP0:1;
      unsigned LRLBP1:1;
      unsigned LRLAP0:1;
      unsigned LRLAP1:1;
      unsigned :3;
      unsigned LCDCST0:1;
      unsigned LCDCST1:1;
      unsigned LCDCST2:1;
    };
  };
} LCDREFBITS;
extern volatile LCDREFBITS LCDREFbits __attribute__((__sfr__));

extern volatile unsigned int  LCDCON __attribute__((__sfr__));
__extension__ typedef struct tagLCDCONBITS {
  union {
    struct {
      unsigned LMUX:3;
      unsigned CS:2;
      unsigned WERR:1;
      unsigned SLPEN:1;
      unsigned :6;
      unsigned LCDSIDL:1;
      unsigned :1;
      unsigned LCDEN:1;
    };
    struct {
      unsigned LMUX0:1;
      unsigned LMUX1:1;
      unsigned LMUX2:1;
      unsigned CS0:1;
      unsigned CS1:1;
    };
  };
} LCDCONBITS;
extern volatile LCDCONBITS LCDCONbits __attribute__((__sfr__));

extern volatile unsigned int  LCDPS __attribute__((__sfr__));
__extension__ typedef struct tagLCDPSBITS {
  union {
    struct {
      unsigned LP:4;
      unsigned WA:1;
      unsigned LCDA:1;
      unsigned BIASMD:1;
      unsigned WFT:1;
    };
    struct {
      unsigned LP0:1;
      unsigned LP1:1;
      unsigned LP2:1;
      unsigned LP3:1;
    };
  };
} LCDPSBITS;
extern volatile LCDPSBITS LCDPSbits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA0 __attribute__((__sfr__));
typedef struct tagLCDDATA0BITS {
  unsigned S0C0:1;
  unsigned S1C0:1;
  unsigned S2C0:1;
  unsigned S3C0:1;
  unsigned S4C0:1;
  unsigned S5C0:1;
  unsigned S6C0:1;
  unsigned S7C0:1;
  unsigned S8C0:1;
  unsigned S9C0:1;
  unsigned S10C0:1;
  unsigned S11C0:1;
  unsigned S12C0:1;
  unsigned S13C0:1;
  unsigned S14C0:1;
  unsigned S15C0:1;
} LCDDATA0BITS;
extern volatile LCDDATA0BITS LCDDATA0bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA1 __attribute__((__sfr__));
typedef struct tagLCDDATA1BITS {
  unsigned S16C0:1;
  unsigned S17C0:1;
  unsigned S18C0:1;
  unsigned S19C0:1;
  unsigned S20C0:1;
  unsigned S21C0:1;
  unsigned S22C0:1;
  unsigned S23C0:1;
  unsigned S24C0:1;
  unsigned S25C0:1;
  unsigned S26C0:1;
  unsigned S27C0:1;
  unsigned :2;
  unsigned S30C0:1;
} LCDDATA1BITS;
extern volatile LCDDATA1BITS LCDDATA1bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA2 __attribute__((__sfr__));
typedef struct tagLCDDATA2BITS {
  unsigned S32C0:1;
  unsigned S33C0:1;
  unsigned S34C0:1;
  unsigned S35C0:1;
  unsigned S36C0:1;
  unsigned S37C0:1;
  unsigned S38C0:1;
  unsigned S39C0:1;
  unsigned S40C0:1;
  unsigned S41C0:1;
  unsigned S42C0:1;
  unsigned S43C0:1;
  unsigned S44C0:1;
  unsigned S45C0:1;
  unsigned S46C0:1;
  unsigned S47C0:1;
} LCDDATA2BITS;
extern volatile LCDDATA2BITS LCDDATA2bits __attribute__((__sfr__));

