IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ128GC008.h
extern volatile unsigned int  LCDDATA19 __attribute__((__sfr__));
typedef struct tagLCDDATA19BITS {
  unsigned S48C4:1;
  unsigned S49C4:1;
  unsigned :12;
  unsigned S62C4:1;
  unsigned S63C4:1;
} LCDDATA19BITS;
extern volatile LCDDATA19BITS LCDDATA19bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA20 __attribute__((__sfr__));
typedef struct tagLCDDATA20BITS {
  unsigned S0C5:1;
  unsigned S1C5:1;
  unsigned S2C5:1;
  unsigned S3C5:1;
  unsigned S4C5:1;
  unsigned S5C5:1;
  unsigned S6C5:1;
  unsigned S7C5:1;
  unsigned S8C5:1;
  unsigned S9C5:1;
  unsigned S10C5:1;
  unsigned S11C5:1;
  unsigned S12C5:1;
  unsigned S13C5:1;
  unsigned S14C5:1;
  unsigned S15C5:1;
} LCDDATA20BITS;
extern volatile LCDDATA20BITS LCDDATA20bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA21 __attribute__((__sfr__));
typedef struct tagLCDDATA21BITS {
  unsigned S16C5:1;
  unsigned S17C5:1;
  unsigned S18C5:1;
  unsigned S19C5:1;
  unsigned S20C5:1;
  unsigned S21C5:1;
  unsigned S22C5:1;
  unsigned S23C5:1;
  unsigned S24C5:1;
  unsigned S25C5:1;
  unsigned S26C5:1;
  unsigned S27C5:1;
  unsigned :2;
  unsigned S30C5:1;
  unsigned S31C5:1;
} LCDDATA21BITS;
extern volatile LCDDATA21BITS LCDDATA21bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA22 __attribute__((__sfr__));
typedef struct tagLCDDATA22BITS {
  unsigned S32C5:1;
  unsigned S33C5:1;
  unsigned S34C5:1;
  unsigned S35C5:1;
  unsigned S36C5:1;
  unsigned S37C5:1;
  unsigned S38C5:1;
  unsigned S39C5:1;
  unsigned S40C5:1;
  unsigned S41C5:1;
  unsigned S42C5:1;
  unsigned S43C5:1;
  unsigned S44C5:1;
  unsigned S45C5:1;
  unsigned S46C5:1;
  unsigned S47C5:1;
} LCDDATA22BITS;
extern volatile LCDDATA22BITS LCDDATA22bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA23 __attribute__((__sfr__));
typedef struct tagLCDDATA23BITS {
  unsigned S48C5:1;
  unsigned S49C5:1;
  unsigned :12;
  unsigned S62C5:1;
  unsigned S63C5:1;
} LCDDATA23BITS;
extern volatile LCDDATA23BITS LCDDATA23bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA24 __attribute__((__sfr__));
typedef struct tagLCDDATA24BITS {
  unsigned S0C6:1;
  unsigned S1C6:1;
  unsigned S2C6:1;
  unsigned S3C6:1;
  unsigned S4C6:1;
  unsigned S5C6:1;
  unsigned S6C6:1;
  unsigned S7C6:1;
  unsigned S8C6:1;
  unsigned S9C6:1;
  unsigned S10C6:1;
  unsigned S11C6:1;
  unsigned S12C6:1;
  unsigned S13C6:1;
  unsigned S14C6:1;
  unsigned S15C6:1;
} LCDDATA24BITS;
extern volatile LCDDATA24BITS LCDDATA24bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA25 __attribute__((__sfr__));
typedef struct tagLCDDATA25BITS {
  unsigned S16C6:1;
  unsigned S17C6:1;
  unsigned S18C6:1;
  unsigned S19C6:1;
  unsigned S20C6:1;
  unsigned S21C6:1;
  unsigned S22C6:1;
  unsigned S23C6:1;
  unsigned S24C6:1;
  unsigned S25C6:1;
  unsigned S26C6:1;
  unsigned S27C6:1;
  unsigned :2;
  unsigned S30C6:1;
  unsigned S31C6:1;
} LCDDATA25BITS;
extern volatile LCDDATA25BITS LCDDATA25bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA26 __attribute__((__sfr__));
typedef struct tagLCDDATA26BITS {
  unsigned S32C6:1;
  unsigned S33C6:1;
  unsigned S34C6:1;
  unsigned S35C6:1;
  unsigned S36C6:1;
  unsigned S37C6:1;
  unsigned S38C6:1;
  unsigned S39C6:1;
  unsigned S40C6:1;
  unsigned S41C6:1;
  unsigned S42C6:1;
  unsigned S43C6:1;
  unsigned S44C6:1;
  unsigned S45C6:1;
  unsigned S46C6:1;
  unsigned S47C6:1;
} LCDDATA26BITS;
extern volatile LCDDATA26BITS LCDDATA26bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA27 __attribute__((__sfr__));
typedef struct tagLCDDATA27BITS {
  unsigned S48C6:1;
  unsigned S49C6:1;
  unsigned :12;
  unsigned S62C6:1;
  unsigned S63C6:1;
} LCDDATA27BITS;
extern volatile LCDDATA27BITS LCDDATA27bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA28 __attribute__((__sfr__));
typedef struct tagLCDDATA28BITS {
  unsigned S0C7:1;
  unsigned S1C7:1;
  unsigned S2C7:1;
  unsigned S3C7:1;
  unsigned S4C7:1;
  unsigned S5C7:1;
  unsigned S6C7:1;
  unsigned S7C7:1;
  unsigned S8C7:1;
  unsigned S9C7:1;
  unsigned S10C7:1;
  unsigned S11C7:1;
  unsigned S12C7:1;
  unsigned S13C7:1;
  unsigned S14C7:1;
  unsigned S15C7:1;
} LCDDATA28BITS;
extern volatile LCDDATA28BITS LCDDATA28bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA29 __attribute__((__sfr__));
typedef struct tagLCDDATA29BITS {
  unsigned S16C7:1;
  unsigned S17C7:1;
  unsigned S18C7:1;
  unsigned S19C7:1;
  unsigned S20C7:1;
  unsigned S21C7:1;
  unsigned S22C7:1;
  unsigned S23C7:1;
  unsigned S24C7:1;
  unsigned S25C7:1;
  unsigned S26C7:1;
  unsigned S27C7:1;
  unsigned :2;
  unsigned S30C7:1;
  unsigned S31C7:1;
} LCDDATA29BITS;
extern volatile LCDDATA29BITS LCDDATA29bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA30 __attribute__((__sfr__));
typedef struct tagLCDDATA30BITS {
  unsigned S32C7:1;
  unsigned S33C7:1;
  unsigned S34C7:1;
  unsigned S35C7:1;
  unsigned S36C7:1;
  unsigned S37C7:1;
  unsigned S38C7:1;
  unsigned S39C7:1;
  unsigned S40C7:1;
  unsigned S41C7:1;
  unsigned S42C7:1;
  unsigned S43C7:1;
  unsigned S44C7:1;
  unsigned S45C7:1;
  unsigned S46C7:1;
  unsigned S47C7:1;
} LCDDATA30BITS;
extern volatile LCDDATA30BITS LCDDATA30bits __attribute__((__sfr__));

extern volatile unsigned int  LCDDATA31 __attribute__((__sfr__));
typedef struct tagLCDDATA31BITS {
  unsigned S48C7:1;
  unsigned S49C7:1;
  unsigned :12;
  unsigned S62C7:1;
  unsigned S63C7:1;
} LCDDATA31BITS;
extern volatile LCDDATA31BITS LCDDATA31bits __attribute__((__sfr__));

extern volatile unsigned int  LCDSE0 __attribute__((__sfr__));
typedef struct tagLCDSE0BITS {
  unsigned SE00:1;
  unsigned SE01:1;
  unsigned SE02:1;
  unsigned SE03:1;
  unsigned SE04:1;
  unsigned SE05:1;
  unsigned SE06:1;
  unsigned SE07:1;
  unsigned SE08:1;
  unsigned SE09:1;
  unsigned SE10:1;
  unsigned SE11:1;
  unsigned SE12:1;
  unsigned SE13:1;
  unsigned SE14:1;
  unsigned SE15:1;
} LCDSE0BITS;
extern volatile LCDSE0BITS LCDSE0bits __attribute__((__sfr__));

extern volatile unsigned int  LCDSE1 __attribute__((__sfr__));
typedef struct tagLCDSE1BITS {
  unsigned SE16:1;
  unsigned SE17:1;
  unsigned SE18:1;
  unsigned SE19:1;
  unsigned SE20:1;
  unsigned SE21:1;
  unsigned SE22:1;
  unsigned SE23:1;
  unsigned SE24:1;
  unsigned SE25:1;
  unsigned SE26:1;
  unsigned SE27:1;
  unsigned :2;
  unsigned SE30:1;
  unsigned SE31:1;
} LCDSE1BITS;
extern volatile LCDSE1BITS LCDSE1bits __attribute__((__sfr__));

extern volatile unsigned int  LCDSE2 __attribute__((__sfr__));
typedef struct tagLCDSE2BITS {
  unsigned SE32:1;
  unsigned SE33:1;
  unsigned SE34:1;
  unsigned SE35:1;
  unsigned SE36:1;
  unsigned SE37:1;
  unsigned SE38:1;
  unsigned SE39:1;
  unsigned SE40:1;
  unsigned SE41:1;
  unsigned SE42:1;
  unsigned SE43:1;
  unsigned SE44:1;
  unsigned SE45:1;
  unsigned SE46:1;
  unsigned SE47:1;
} LCDSE2BITS;
extern volatile LCDSE2BITS LCDSE2bits __attribute__((__sfr__));

extern volatile unsigned int  LCDSE3 __attribute__((__sfr__));
typedef struct tagLCDSE3BITS {
  unsigned SE48:1;
  unsigned SE49:1;
  unsigned :12;
  unsigned SE62:1;
  unsigned SE63:1;
} LCDSE3BITS;
extern volatile LCDSE3BITS LCDSE3bits __attribute__((__sfr__));

extern volatile unsigned int  PMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON1BITS {
  union {
    struct {
      unsigned IRQM:2;
      unsigned BUSKEEP:1;
      unsigned :1;
      unsigned ALMODE:1;
      unsigned ALP:1;
      unsigned CSF:2;
      unsigned MODE:2;
      unsigned :1;
      unsigned ADRMUX:2;
      unsigned PSIDL:1;
      unsigned :1;
      unsigned PMPEN:1;
    };
    struct {
      unsigned IRQM0:1;
      unsigned IRQM1:1;
      unsigned :4;
      unsigned CSF0:1;
      unsigned CSF1:1;
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :1;
      unsigned ADRMUX0:1;
      unsigned ADRMUX1:1;
    };
  };
} PMCON1BITS;
extern volatile PMCON1BITS PMCON1bits __attribute__((__sfr__));

extern volatile unsigned int  PMCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON2BITS {
  union {
    struct {
      unsigned RADDR:8;
      unsigned :4;
      unsigned TIMEOUT:1;
      unsigned ERROR:1;
      unsigned :1;
      unsigned BUSY:1;
    };
    struct {
      unsigned RADDR16:1;
      unsigned RADDR17:1;
      unsigned RADDR18:1;
      unsigned RADDR19:1;
      unsigned RADDR20:1;
      unsigned RADDR21:1;
      unsigned RADDR22:1;
      unsigned RADDR23:1;
    };
  };
} PMCON2BITS;
extern volatile PMCON2BITS PMCON2bits __attribute__((__sfr__));

extern volatile unsigned int  PMCON3 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON3BITS {
  union {
    struct {
      unsigned PTEN16:1;
      unsigned PTEN17:1;
      unsigned PTEN18:1;
      unsigned PTEN19:1;
      unsigned PTEN20:1;
      unsigned PTEN21:1;
      unsigned PTEN22:1;
      unsigned :1;
      unsigned AWAITE:1;
      unsigned AWAITM:2;
      unsigned :1;
      unsigned PTBE0EN:1;
      unsigned PTBE1EN:1;
      unsigned PTRDEN:1;
      unsigned PTWREN:1;
    };
    struct {
      unsigned :9;
      unsigned AWAITM0:1;
      unsigned AWAITM1:1;
    };
  };
} PMCON3BITS;
extern volatile PMCON3BITS PMCON3bits __attribute__((__sfr__));

extern volatile unsigned int  PMCON4 __attribute__((__sfr__));
typedef struct tagPMCON4BITS {
  unsigned PTEN0:1;
  unsigned PTEN1:1;
  unsigned PTEN2:1;
  unsigned PTEN3:1;
  unsigned PTEN4:1;
  unsigned PTEN5:1;
  unsigned PTEN6:1;
  unsigned PTEN7:1;
  unsigned PTEN8:1;
  unsigned PTEN9:1;
  unsigned PTEN10:1;
  unsigned PTEN11:1;
  unsigned PTEN12:1;
  unsigned PTEN13:1;
  unsigned PTEN14:1;
  unsigned PTEN15:1;
} PMCON4BITS;
extern volatile PMCON4BITS PMCON4bits __attribute__((__sfr__));

extern volatile unsigned int  PMCS1CF __attribute__((__sfr__));
__extension__ typedef struct tagPMCS1CFBITS {
  union {
    struct {
      unsigned :5;
      unsigned PTSZ:2;
      unsigned ACKP:1;
      unsigned SM:1;
      unsigned RDSP:1;
      unsigned WRSP:1;
      unsigned :1;
      unsigned BEP:1;
      unsigned CSPTEN:1;
      unsigned CSP:1;
      unsigned CSDIS:1;
    };
    struct {
      unsigned :5;
      unsigned PTSZ0:1;
      unsigned PTSZ1:1;
    };
  };
} PMCS1CFBITS;
