IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ128GC008.h
/* ADL1MSEL3 */
/* Bitname _MSEL48 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL49 cannot be defined because it is used by more than one SFR */

/* ADL2CONL */
/* Bitname _SLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _THSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SLENCLR cannot be defined because it is used by more than one SFR */
/* Bitname _SAMP cannot be defined because it is used by more than one SFR */
/* Bitname _SLEN cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC4 cannot be defined because it is used by more than one SFR */

/* ADL2CONH */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _MULCHEN cannot be defined because it is used by more than one SFR */
/* Bitname _PINTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _CTMEN cannot be defined because it is used by more than one SFR */
/* Bitname _CM cannot be defined because it is used by more than one SFR */
/* Bitname _WM cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEN cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _CM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CM2 cannot be defined because it is used by more than one SFR */
/* Bitname _WM0 cannot be defined because it is used by more than one SFR */
/* Bitname _WM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT1 cannot be defined because it is used by more than one SFR */

/* ADL2PTR */
/* Bitname _ADNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT6 cannot be defined because it is used by more than one SFR */

/* ADL2STAT */
/* Bitname _ADLIF cannot be defined because it is used by more than one SFR */
/* Bitname _ADTDLY cannot be defined because it is used by more than one SFR */
/* Bitname _LBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _ADTACT cannot be defined because it is used by more than one SFR */

/* ADTH2L */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADTH2H */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADL2MSEL0 */
/* Bitname _MSEL15 cannot be defined because it is used by more than one SFR */

/* ADL2MSEL1 */
/* Bitname _MSEL16 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL17 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL18 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL19 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL20 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL21 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL22 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL23 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL24 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL25 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL26 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL27 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL28 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL29 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL30 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL31 cannot be defined because it is used by more than one SFR */

