IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ128GC008.h
/* LCDDATA26 */
#define _S32C6 LCDDATA26bits.S32C6
#define _S33C6 LCDDATA26bits.S33C6
#define _S34C6 LCDDATA26bits.S34C6
#define _S35C6 LCDDATA26bits.S35C6
#define _S36C6 LCDDATA26bits.S36C6
#define _S37C6 LCDDATA26bits.S37C6
#define _S38C6 LCDDATA26bits.S38C6
#define _S39C6 LCDDATA26bits.S39C6
#define _S40C6 LCDDATA26bits.S40C6
#define _S41C6 LCDDATA26bits.S41C6
#define _S42C6 LCDDATA26bits.S42C6
#define _S43C6 LCDDATA26bits.S43C6
#define _S44C6 LCDDATA26bits.S44C6
#define _S45C6 LCDDATA26bits.S45C6
#define _S46C6 LCDDATA26bits.S46C6
#define _S47C6 LCDDATA26bits.S47C6

/* LCDDATA27 */
#define _S48C6 LCDDATA27bits.S48C6
#define _S49C6 LCDDATA27bits.S49C6
#define _S62C6 LCDDATA27bits.S62C6
#define _S63C6 LCDDATA27bits.S63C6

/* LCDDATA28 */
#define _S0C7 LCDDATA28bits.S0C7
#define _S1C7 LCDDATA28bits.S1C7
#define _S2C7 LCDDATA28bits.S2C7
#define _S3C7 LCDDATA28bits.S3C7
#define _S4C7 LCDDATA28bits.S4C7
#define _S5C7 LCDDATA28bits.S5C7
#define _S6C7 LCDDATA28bits.S6C7
#define _S7C7 LCDDATA28bits.S7C7
#define _S8C7 LCDDATA28bits.S8C7
#define _S9C7 LCDDATA28bits.S9C7
#define _S10C7 LCDDATA28bits.S10C7
#define _S11C7 LCDDATA28bits.S11C7
#define _S12C7 LCDDATA28bits.S12C7
#define _S13C7 LCDDATA28bits.S13C7
#define _S14C7 LCDDATA28bits.S14C7
#define _S15C7 LCDDATA28bits.S15C7

/* LCDDATA29 */
#define _S16C7 LCDDATA29bits.S16C7
#define _S17C7 LCDDATA29bits.S17C7
#define _S18C7 LCDDATA29bits.S18C7
#define _S19C7 LCDDATA29bits.S19C7
#define _S20C7 LCDDATA29bits.S20C7
#define _S21C7 LCDDATA29bits.S21C7
#define _S22C7 LCDDATA29bits.S22C7
#define _S23C7 LCDDATA29bits.S23C7
#define _S24C7 LCDDATA29bits.S24C7
#define _S25C7 LCDDATA29bits.S25C7
#define _S26C7 LCDDATA29bits.S26C7
#define _S27C7 LCDDATA29bits.S27C7
#define _S30C7 LCDDATA29bits.S30C7
#define _S31C7 LCDDATA29bits.S31C7

/* LCDDATA30 */
#define _S32C7 LCDDATA30bits.S32C7
#define _S33C7 LCDDATA30bits.S33C7
#define _S34C7 LCDDATA30bits.S34C7
#define _S35C7 LCDDATA30bits.S35C7
#define _S36C7 LCDDATA30bits.S36C7
#define _S37C7 LCDDATA30bits.S37C7
#define _S38C7 LCDDATA30bits.S38C7
#define _S39C7 LCDDATA30bits.S39C7
#define _S40C7 LCDDATA30bits.S40C7
#define _S41C7 LCDDATA30bits.S41C7
#define _S42C7 LCDDATA30bits.S42C7
#define _S43C7 LCDDATA30bits.S43C7
#define _S44C7 LCDDATA30bits.S44C7
#define _S45C7 LCDDATA30bits.S45C7
#define _S46C7 LCDDATA30bits.S46C7
#define _S47C7 LCDDATA30bits.S47C7

/* LCDDATA31 */
#define _S48C7 LCDDATA31bits.S48C7
#define _S49C7 LCDDATA31bits.S49C7
#define _S62C7 LCDDATA31bits.S62C7
#define _S63C7 LCDDATA31bits.S63C7

/* LCDSE0 */
#define _SE00 LCDSE0bits.SE00
#define _SE01 LCDSE0bits.SE01
#define _SE02 LCDSE0bits.SE02
#define _SE03 LCDSE0bits.SE03
#define _SE04 LCDSE0bits.SE04
#define _SE05 LCDSE0bits.SE05
#define _SE06 LCDSE0bits.SE06
#define _SE07 LCDSE0bits.SE07
#define _SE08 LCDSE0bits.SE08
#define _SE09 LCDSE0bits.SE09
#define _SE10 LCDSE0bits.SE10
#define _SE11 LCDSE0bits.SE11
#define _SE12 LCDSE0bits.SE12
#define _SE13 LCDSE0bits.SE13
#define _SE14 LCDSE0bits.SE14
#define _SE15 LCDSE0bits.SE15

/* LCDSE1 */
#define _SE16 LCDSE1bits.SE16
#define _SE17 LCDSE1bits.SE17
#define _SE18 LCDSE1bits.SE18
#define _SE19 LCDSE1bits.SE19
#define _SE20 LCDSE1bits.SE20
#define _SE21 LCDSE1bits.SE21
#define _SE22 LCDSE1bits.SE22
#define _SE23 LCDSE1bits.SE23
#define _SE24 LCDSE1bits.SE24
#define _SE25 LCDSE1bits.SE25
#define _SE26 LCDSE1bits.SE26
#define _SE27 LCDSE1bits.SE27
#define _SE30 LCDSE1bits.SE30
#define _SE31 LCDSE1bits.SE31

/* LCDSE2 */
#define _SE32 LCDSE2bits.SE32
#define _SE33 LCDSE2bits.SE33
#define _SE34 LCDSE2bits.SE34
#define _SE35 LCDSE2bits.SE35
#define _SE36 LCDSE2bits.SE36
#define _SE37 LCDSE2bits.SE37
#define _SE38 LCDSE2bits.SE38
#define _SE39 LCDSE2bits.SE39
#define _SE40 LCDSE2bits.SE40
#define _SE41 LCDSE2bits.SE41
#define _SE42 LCDSE2bits.SE42
#define _SE43 LCDSE2bits.SE43
#define _SE44 LCDSE2bits.SE44
#define _SE45 LCDSE2bits.SE45
#define _SE46 LCDSE2bits.SE46
#define _SE47 LCDSE2bits.SE47

/* LCDSE3 */
#define _SE48 LCDSE3bits.SE48
#define _SE49 LCDSE3bits.SE49
#define _SE62 LCDSE3bits.SE62
#define _SE63 LCDSE3bits.SE63

/* PMCON1 */
#define _IRQM PMCON1bits.IRQM
#define _BUSKEEP PMCON1bits.BUSKEEP
#define _ALMODE PMCON1bits.ALMODE
#define _ALP PMCON1bits.ALP
#define _CSF PMCON1bits.CSF
#define _MODE PMCON1bits.MODE
#define _ADRMUX PMCON1bits.ADRMUX
#define _PSIDL PMCON1bits.PSIDL
#define _PMPEN PMCON1bits.PMPEN
#define _IRQM0 PMCON1bits.IRQM0
#define _IRQM1 PMCON1bits.IRQM1
#define _CSF0 PMCON1bits.CSF0
#define _CSF1 PMCON1bits.CSF1
#define _MODE0 PMCON1bits.MODE0
#define _MODE1 PMCON1bits.MODE1
#define _ADRMUX0 PMCON1bits.ADRMUX0
#define _ADRMUX1 PMCON1bits.ADRMUX1

/* PMCON2 */
#define _RADDR PMCON2bits.RADDR
#define _TIMEOUT PMCON2bits.TIMEOUT
#define _ERROR PMCON2bits.ERROR
#define _BUSY PMCON2bits.BUSY
#define _RADDR16 PMCON2bits.RADDR16
#define _RADDR17 PMCON2bits.RADDR17
#define _RADDR18 PMCON2bits.RADDR18
#define _RADDR19 PMCON2bits.RADDR19
#define _RADDR20 PMCON2bits.RADDR20
#define _RADDR21 PMCON2bits.RADDR21
#define _RADDR22 PMCON2bits.RADDR22
#define _RADDR23 PMCON2bits.RADDR23

/* PMCON3 */
#define _PTEN16 PMCON3bits.PTEN16
#define _PTEN17 PMCON3bits.PTEN17
#define _PTEN18 PMCON3bits.PTEN18
#define _PTEN19 PMCON3bits.PTEN19
#define _PTEN20 PMCON3bits.PTEN20
#define _PTEN21 PMCON3bits.PTEN21
#define _PTEN22 PMCON3bits.PTEN22
#define _AWAITE PMCON3bits.AWAITE
#define _AWAITM PMCON3bits.AWAITM
#define _PTBE0EN PMCON3bits.PTBE0EN
#define _PTBE1EN PMCON3bits.PTBE1EN
#define _PTRDEN PMCON3bits.PTRDEN
#define _PTWREN PMCON3bits.PTWREN
#define _AWAITM0 PMCON3bits.AWAITM0
#define _AWAITM1 PMCON3bits.AWAITM1

/* PMCON4 */
#define _PTEN0 PMCON4bits.PTEN0
#define _PTEN1 PMCON4bits.PTEN1
#define _PTEN2 PMCON4bits.PTEN2
#define _PTEN3 PMCON4bits.PTEN3
#define _PTEN4 PMCON4bits.PTEN4
#define _PTEN5 PMCON4bits.PTEN5
#define _PTEN6 PMCON4bits.PTEN6
#define _PTEN7 PMCON4bits.PTEN7
#define _PTEN8 PMCON4bits.PTEN8
#define _PTEN9 PMCON4bits.PTEN9
#define _PTEN10 PMCON4bits.PTEN10
#define _PTEN11 PMCON4bits.PTEN11
#define _PTEN12 PMCON4bits.PTEN12
#define _PTEN13 PMCON4bits.PTEN13
#define _PTEN14 PMCON4bits.PTEN14
#define _PTEN15 PMCON4bits.PTEN15

/* PMCS1CF */
/* Bitname _PTSZ cannot be defined because it is used by more than one SFR */
/* Bitname _ACKP cannot be defined because it is used by more than one SFR */
/* Bitname _SM cannot be defined because it is used by more than one SFR */
/* Bitname _RDSP cannot be defined because it is used by more than one SFR */
/* Bitname _WRSP cannot be defined because it is used by more than one SFR */
/* Bitname _BEP cannot be defined because it is used by more than one SFR */
/* Bitname _CSPTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CSP cannot be defined because it is used by more than one SFR */
/* Bitname _CSDIS cannot be defined because it is used by more than one SFR */
/* Bitname _PTSZ0 cannot be defined because it is used by more than one SFR */
/* Bitname _PTSZ1 cannot be defined because it is used by more than one SFR */

